README.org
#+TITLE: Prisma ORM Training
#+AUTHOR: Rahul M. Juliato
#+EMAIL: rahul.juliato@gmail.com
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Intro

Links:

- [[https://github.com/prisma/prisma][Important link: Prisma Github Repo]]
- [[https://playground.prisma.io/guides][Guides]]

Prisma is a next-generation ORM that consists of these tools:

Prisma Client: Auto-generated and type-safe query builder for Node.js
& TypeScript

Prisma Migrate: Declarative data modeling & migration system

Prisma Studio: GUI to view and edit data in your database

* Setup

Start a new project

#+BEGIN_SRC bash
  npm init -y
  npm i --save-dev prisma typescript ts-node @types/node nodemon
#+END_SRC

Typescript is not obligatory but helps a LOT!

Now we create a `tsconfig.json` file (this is the one recommended):

#+BEGIN_SRC json
{
  "compilerOptions": {
    "sourceMap": true,
    "outDir": "dist",
    "strict": true,
    "lib": ["esnext"],
    "esModuleInterop": true
  }
}
#+END_SRC

Now we initialize prisma :)

#+BEGIN_SRC bash
  npx prisma init
#+END_SRC

or better

#+BEGIN_SRC bash
  npx prisma init --datasource-provider postgresql (or any other)
#+END_SRC

A prisma folder is created.

Explore it.

Explore about Generator and Data Source.

Also explore talk about .env created and .gitignore.

Explore how to make the `.prisma` file be syntax highlighted and LSP aware.

VSCode: using an extension, Prisma.

Show that altering the .prisma file and then saving we have auto
format if it is set to VSCode default.

On VSCode we can ctrl+, (command+,).

Edit the settings on JSON and show/add:

#+BEGIN_SRC json
  "[prisma]": {
    "editor.defaultFormatter": "Prisma.prisma",
    "editor.formatOnSave": true
  },
#+END_SRC

Comment to show how it can be disabled by commenting this code, making
a change and saving.

And if you do not like it when saving, you can programatically do it with:

#+BEGIN_SRC bash
npx prisma format
#+END_SRC

* The basic schema.prisma file and flow

This is a Prisma specific format.

Let's dive into it a bit.

Explain what a generator is.

Explore about providers for your generator and the `generator client`.

Explore `datasource db`.


create a model:

#+BEGIN_SRC prisma
model User {
   id   Int @id @default(autoincrement())
   name String 
}
#+END_SRC

Now we can save.

Prisma and db are completelly different stuff.

Did we changed our db by saving this file?

We need to generate a migration and push it into the database.

So we can migrate from Nothing to our model.

#+BEGIN_SRC bash
npx prisma migrate dev "message here"
#+END_SRC


Pay attention on what is returned.

It says it generated the prisma client. But in order to use it we need
an extra package.

#+BEGIN_SRC bash
  npm install @prisma/client
#+END_SRC

On every migration your client is re-generated, but if you need to
do it manually you can always force the regeneration with:

#+BEGIN_SRC bash
  npx prisma generate client
#+END_SRC

This will also return the magic lines:

#+BEGIN_SRC typescript
  import { PrismaClient } from '@prisma/client'
  const prisma = new PrismaClient()
#+END_SRC

If we create a `script.ts` file and add this lines, we can see that we
may explore this object by typing `prisma` followed by the
completition shortcut on your editor (for VSCode it is Ctrl+Space or
Command+Space).

Explore with prisma, prisma.user...

In order to make something useful from `script.ts` we'll add some
boilerplate code to deal with the async calls.

#+BEGIN_SRC typescript
    import { PrismaClient } from "@prisma/client";
    const prisma = new PrismaClient();
  
    async function main() {
       // We will explore prisma here...

    }

    main()
    .catch((e) => console.error(e.message))
    .finally(async () => {
      await prisma.$disconnect();
    });
#+END_SRC

Talk about this boilerplate and about disconnect.


Add some simple like:
#+BEGIN_SRC typescript
  const user = await prisma.user.create({ data: { name: "Rahul" } });
  console.log(user);
#+END_SRC

In order to execute it let's make some changes to our `package.json`.

Add this script:

#+BEGIN_SRC JSON
  "scripts": {
    "devStart": "nodemon script.ts"
  },
#+END_SRC

Talk about nodemon and --watch

Execute `npm run devStart`.

Change name to other names and see it in action.

Also change user to users and do:

#+BEGIN_SRC typescript
  const users = await prisma.user.findMany({});
  console.log(users);
#+END_SRC

This is the basic preview of what the `.prisma` file does.

Check the file on every item.

Generator => dabase => model => migrations => client

This file allows defining the db, configs it, the schema and the client.
This is a case of "Single Source of Truth".

Prisma has only ONE database.

Also do not forget to be mindiful about the .env file and generate
diff data bases for dev, production, testing, etc.

Generators we can have lots of types and be many.

* Modeling on schema.prisma (99% of what you'll need)
