README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-24 Ter 17:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prisma ORM Training</title>
<meta name="author" content="Rahul M. Juliato" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Prisma ORM Training</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga832ed6">1. Intro</a></li>
<li><a href="#org88c2402">2. Setup</a></li>
<li><a href="#org911db61">3. The basic schema.prisma file and flow</a></li>
<li><a href="#orgcb3a83a">4. Modeling on schema.prisma (99% of what you'll need)</a>
<ul>
<li><a href="#org705478a">4.1. Basic</a></li>
<li><a href="#orgddaf2b1">4.2. One to Many</a></li>
<li><a href="#orgc11f3af">4.3. Multiple One to Many</a></li>
<li><a href="#orgf459c04">4.4. Many to Many</a></li>
<li><a href="#org338ec8d">4.5. One to One</a></li>
<li><a href="#orgf417e29">4.6. A little bit refactoring</a></li>
<li><a href="#org8e2b68b">4.7. Block Level Attributes</a></li>
<li><a href="#org7cd09b8">4.8. Enum</a></li>
<li><a href="#orgd50674e">4.9. Migrating</a></li>
</ul>
</li>
<li><a href="#orgf3c55ee">5. Exploring the client</a>
<ul>
<li><a href="#org5d98ba2">5.1. Intro</a></li>
<li><a href="#orgc376814">5.2. Creating</a></li>
<li><a href="#org9b672a1">5.3. Finding (reading data)</a></li>
<li><a href="#org3ebc3c7">5.4. Updating</a></li>
<li><a href="#org50df675">5.5. Add and Connect Existent Relationships</a></li>
<li><a href="#org942bc34">5.6. Deleting</a></li>
</ul>
</li>
<li><a href="#org53744c6">6. Future topics</a>
<ul>
<li><a href="#orgd0d6e50">6.1. Views</a></li>
<li><a href="#orgd3a610d">6.2. Importing database to prisma</a></li>
<li><a href="#org48c1185">6.3. GraphQL client</a></li>
<li><a href="#org85dc1ca">6.4. REPL</a></li>
<li><a href="#org7164949">6.5. DB Push</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga832ed6" class="outline-2">
<h2 id="orga832ed6"><span class="section-number-2">1.</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
Links:
</p>

<ul class="org-ul">
<li><a href="https://github.com/prisma/prisma">Important link: Prisma Github Repo</a></li>
<li><a href="https://playground.prisma.io/guides">Guides</a></li>
</ul>

<p>
Prisma is a next-generation ORM that consists of these tools:
</p>

<p>
Prisma Client: Auto-generated and type-safe query builder for Node.js
&amp; TypeScript
</p>

<p>
Prisma Migrate: Declarative data modeling &amp; migration system
</p>

<p>
Prisma Studio: GUI to view and edit data in your database
</p>
</div>
</div>

<div id="outline-container-org88c2402" class="outline-2">
<h2 id="org88c2402"><span class="section-number-2">2.</span> Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Start a new project
</p>

<div class="org-src-container">
<pre class="src src-bash">npm init -y
npm i --save-dev prisma typescript ts-node @types/node nodemon
</pre>
</div>

<p>
Typescript is not obligatory but helps a LOT!
</p>

<p>
Now we create a `tsconfig.json` file (this is the one recommended):
</p>

<div class="org-src-container">
<pre class="src src-json">{
  "compilerOptions": {
    "sourceMap": true,
    "outDir": "dist",
    "strict": true,
    "lib": ["esnext"],
    "esModuleInterop": true
  }
}
</pre>
</div>

<p>
Now we initialize prisma :)
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma init
</pre>
</div>

<p>
or better
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma init --datasource-provider postgresql (or any other)
</pre>
</div>

<p>
A prisma folder is created.
</p>

<p>
Explore it.
</p>

<p>
Explore about Generator and Data Source.
</p>

<p>
Also explore talk about .env created and .gitignore.
</p>

<p>
Explore how to make the `.prisma` file be syntax highlighted and LSP aware.
</p>

<p>
VSCode: using an extension, Prisma.
</p>

<p>
Show that altering the .prisma file and then saving we have auto
format if it is set to VSCode default.
</p>

<p>
On VSCode we can ctrl+, (command+,).
</p>

<p>
Edit the settings on JSON and show/add:
</p>

<div class="org-src-container">
<pre class="src src-json">"[prisma]": {
  "editor.defaultFormatter": "Prisma.prisma",
  "editor.formatOnSave": true
},
</pre>
</div>

<p>
Comment to show how it can be disabled by commenting this code, making
a change and saving.
</p>

<p>
And if you do not like it when saving, you can programatically do it with:
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma format
</pre>
</div>
</div>
</div>

<div id="outline-container-org911db61" class="outline-2">
<h2 id="org911db61"><span class="section-number-2">3.</span> The basic schema.prisma file and flow</h2>
<div class="outline-text-2" id="text-3">
<p>
This is a Prisma specific format.
</p>

<p>
Let's dive into it a bit.
</p>

<p>
Explain what a generator is.
</p>

<p>
Explore about providers for your generator and the `generator client`.
</p>

<p>
Explore `datasource db`.
</p>


<p>
create a model:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
   id   Int @id @default(autoincrement())
   name String 
}
</pre>
</div>

<p>
Now we can save.
</p>

<p>
Prisma and db are completelly different stuff.
</p>

<p>
Did we changed our db by saving this file?
</p>

<p>
We need to generate a migration and push it into the database.
</p>

<p>
So we can migrate from Nothing to our model.
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma migrate dev "message here"
</pre>
</div>


<p>
Pay attention on what is returned.
</p>

<p>
It says it generated the prisma client. But in order to use it we need
an extra package.
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install @prisma/client
</pre>
</div>

<p>
On every migration your client is re-generated, but if you need to
do it manually you can always force the regeneration with:
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma generate client
</pre>
</div>

<p>
This will also return the magic lines:
</p>

<div class="org-src-container">
<pre class="src src-typescript">import { PrismaClient } from '@prisma/client'
const prisma = new PrismaClient()
</pre>
</div>

<p>
If we create a `script.ts` file and add this lines, we can see that we
may explore this object by typing `prisma` followed by the
completition shortcut on your editor (for VSCode it is Ctrl+Space or
Command+Space).
</p>

<p>
Explore with prisma, prisma.user&#x2026;
</p>

<p>
In order to make something useful from `script.ts` we'll add some
boilerplate code to deal with the async calls.
</p>

<div class="org-src-container">
<pre class="src src-typescript">import { PrismaClient } from "@prisma/client";
const prisma = new PrismaClient();

async function main() {
   // We will explore prisma here...

}

main()
.catch((e) =&gt; console.error(e.message))
.finally(async () =&gt; {
  await prisma.$disconnect();
});
</pre>
</div>

<p>
Talk about this boilerplate and about disconnect.
</p>


<p>
Add some simple like:
</p>
<div class="org-src-container">
<pre class="src src-typescript">const user = await prisma.user.create({ data: { name: "Rahul" } });
console.log(user);
</pre>
</div>

<p>
In order to execute it let's make some changes to our `package.json`.
</p>

<p>
Add this script:
</p>

<div class="org-src-container">
<pre class="src src-JSON">"scripts": {
  "devStart": "nodemon script.ts"
},
</pre>
</div>

<p>
Talk about nodemon and &#x2013;watch
</p>

<p>
Execute `npm run devStart`.
</p>

<p>
Change name to other names and see it in action.
</p>

<p>
Also change user to users and do:
</p>

<div class="org-src-container">
<pre class="src src-typescript">const users = await prisma.user.findMany({});
console.log(users);
</pre>
</div>

<p>
This is the basic preview of what the `.prisma` file does.
</p>

<p>
Check the file on every item.
</p>

<p>
Generator =&gt; dabase =&gt; model =&gt; migrations =&gt; client
</p>

<p>
This file allows defining the db, configs it, the schema and the client.
This is a case of "Single Source of Truth".
</p>

<p>
Prisma has only ONE database.
</p>

<p>
Also do not forget to be mindiful about the .env file and generate
diff data bases for dev, production, testing, etc.
</p>

<p>
Generators we can have lots of types and be many.
</p>
</div>
</div>

<div id="outline-container-orgcb3a83a" class="outline-2">
<h2 id="orgcb3a83a"><span class="section-number-2">4.</span> Modeling on schema.prisma (99% of what you'll need)</h2>
<div class="outline-text-2" id="text-4">
</div>
