README.org
** Basic
Back to our `schema.prisma`.

Models represent diferent tables on your base we're data will be
stored.

Each model line is a Field, the field can have four different parts.

2 obligatory, 2 optional.

Name, Type, Field Modifiers and Attributes.

Explore the model by adding.

Let's explore the field types.

Int, String, Boolean, BigInt, Float, Decimal, DateTime, Json (some
only), Bytes, Unsupported("")

Explore that prisma can be connected to a database that already exists
and convert its schema. And if there's no relation between a db
feature and prisma, this will be marked as an Unsupported.

#+BEGIN_SRC prisma
  model User {
    id            String  @id @default(uuid())
    age           Int
    name          String
    email         String
    isAdmin       Boolean
    preferences   Json
  }
#+END_SRC

#+BEGIN_SRC prisma
  model Post {
      rating    Float
      createdAt DateTime
      updatedAt DateTime
    //author    User
  }
#+END_SRC


Then talk about adding `author User` to Post model.

Explore about what will happen if you save and how a dev should be
aware of "magic"

Let's talk about relationships.
- One to many (A post has one author and an author has many posts)
- Many to many (One post can have many categories and one category may
  have many posts)
- One to one (If a user has a table of preferences, and each
  preference has one user that links it)

We're gonna cover all.

** One to Many
A user can have many posts.

Save, see the magic, and alter to:

#+BEGIN_SRC prisma
  model User {
    id      Int     @id @default(autoincrement())
    name    String
    email   String
    isAdmin Boolean
    //  preferences Json
    Post    Post[]
  }

  model Post {
    rating    Float
    createdAt DateTime
    updatedAt DateTime
    author    User     @relation(fields: [userId], references: [id])
    userId    Int
  }
#+END_SRC

Explore first about `Post[]` the type modifier. There's only two:
- [] Array (multiple of the thing)
- ?  Optional

Explore relations to primary key in SQL.

Change userId to authorId.

Another thing we may do is use uuid() instead of autoincrement(). And so
change the type to string.

Explore what is missing on Post. Add its own Id.

The end of this part should be:

#+BEGIN_SRC prisma
model User {
  id      String  @id @default(uuid())
  name    String
  email   String
  isAdmin Boolean
  //  preferences Json
  Post    Post[]
}

model Post {
  id        String   @id @default(uuid())
  rating    Float
  createdAt DateTime
  updatedAt DateTime
  author    User     @relation(fields: [authorId], references: [id])
  authorId  String
}
#+END_SRC

** Multiple One to Many
Change User and Post models to:

#+BEGIN_SRC prisma
  model User {
    id            String  @id @default(uuid())
    name          String
    email         String
    isAdmin       Boolean
    writtenPosts  Post[]
    favoritePosts Post[]
  }

  model Post {
    id            String   @id @default(uuid())
    rating        Float
    createdAt     DateTime
    updatedAt     DateTime
    author        User     @relation(fields: [authorId], references: [id])
    authorId      String
    favoritedBy   User     @relation(fields: [favoritedById], references: [id])
    favoritedById String
  } 


#+END_SRC

Wich relation is pointint to which? This is ambiguous.

We may give a name to the Post relation and THEN refer to it on User.

Only then save it, show what happens if you save after changing post
but not inserting the relation to User.

#+BEGIN_SRC prisma
model User {
  id            String  @id @default(uuid())
  name          String
  email         String
  isAdmin       Boolean
  writtenPosts  Post[] @relation("WrittenPosts")
  favoritePosts Post[] @relation("FavoritePosts")
}

model Post {
  id            String   @id @default(uuid())
  rating        Float
  createdAt     DateTime
  updatedAt     DateTime
  author        User     @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User?     @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String?
}
#+END_SRC

For the last, explore changing favoritedBy and favoritedById to optional.

This is ok for disanbiguating multiple one to many relationships. But
what about...

** Many to Many

Create the Category model and add the many to many relation to both
Category and Post.

#+BEGIN_SRC prisma
  model Category {
    id    String @id @default(uuid())
    posts Post[]
  }

  model Post {
    id            String     @id @default(uuid())
    rating        Float
    createdAt     DateTime
    updatedAt     DateTime
    author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
    authorId      String
    favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
    favoritedById String
    categories    Category[]
  }
#+END_SRC

We don't need to make any to do any fancy @relationship, it
automatically knows the references.

And it is automatically going to create a JOIN table that is going to
hook up all this relationships for us.

All the complicated JOIN stuff we need to do to many to many
relationships is taken care by Prisma, you don't need to worry about
that at all.

** One to One

Let's create a new model, UserPreference. Since we want one to one, we can declare
the relationship on ether model. We'll do it inside UserPreferences.

#+BEGIN_SRC prisma
model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user User
  userId String
}
#+END_SRC

When we save it, a lot is done automatically, lets just change it a bit.

On User change the array to "one" relationship deleting [] and passing ?.

If not automatically, we need to define userId as @unique.

We know must have:
#+BEGIN_SRC prisma
model User {
  id             String          @id @default(uuid())
  name           String
  email          String
  isAdmin        Boolean
  writtenPosts   Post[]          @relation("WrittenPosts")
  favoritePosts  Post[]          @relation("FavoritePosts")
  UserPreference UserPreference?
}

model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user         User    @relation(fields: [userId], references: [id])
  userId       String  @unique
}  


#+END_SRC

Let's talk about the attributes we've seen so far and add @updatedAt and also
@default(now()).

We now may have a Post model like this:

#+BEGIN_SRC prisma
model Post {
  id            String     @id @default(uuid())
  rating        Float
  createdAt     DateTime   @default(now())
  updatedAt     DateTime   @updatedAt
  author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String
  categories    Category[]
}
#+END_SRC

