README.html
<div id="outline-container-org705478a" class="outline-3">
<h3 id="org705478a"><span class="section-number-3">4.1.</span> Basic</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Back to our `schema.prisma`.
</p>

<p>
Models represent diferent tables on your base we're data will be
stored.
</p>

<p>
Each model line is a Field, the field can have four different parts.
</p>

<p>
2 obligatory, 2 optional.
</p>

<p>
Name, Type, Field Modifiers and Attributes.
</p>

<p>
Explore the model by adding.
</p>

<p>
Let's explore the field types.
</p>

<p>
Int, String, Boolean, BigInt, Float, Decimal, DateTime, Json (some
only), Bytes, Unsupported("")
</p>

<p>
Explore that prisma can be connected to a database that already exists
and convert its schema. And if there's no relation between a db
feature and prisma, this will be marked as an Unsupported.
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id            String  @id @default(uuid())
  age           Int
  name          String
  email         String
  isAdmin       Boolean
  preferences   Json
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prisma">model Post {
    rating    Float
    createdAt DateTime
    updatedAt DateTime
  //author    User
}
</pre>
</div>


<p>
Then talk about adding `author User` to Post model.
</p>

<p>
Explore about what will happen if you save and how a dev should be
aware of "magic"
</p>

<p>
Let's talk about relationships.
</p>
<ul class="org-ul">
<li>One to many (A post has one author and an author has many posts)</li>
<li>Many to many (One post can have many categories and one category may
have many posts)</li>
<li>One to one (If a user has a table of preferences, and each
preference has one user that links it)</li>
</ul>

<p>
We're gonna cover all.
</p>
</div>
</div>

<div id="outline-container-orgddaf2b1" class="outline-3">
<h3 id="orgddaf2b1"><span class="section-number-3">4.2.</span> One to Many</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A user can have many posts.
</p>

<p>
Save, see the magic, and alter to:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id      Int     @id @default(autoincrement())
  name    String
  email   String
  isAdmin Boolean
  //  preferences Json
  Post    Post[]
}

model Post {
  rating    Float
  createdAt DateTime
  updatedAt DateTime
  author    User     @relation(fields: [userId], references: [id])
  userId    Int
}
</pre>
</div>

<p>
Explore first about `Post[]` the type modifier. There's only two:
</p>
<ul class="org-ul">
<li>[] Array (multiple of the thing)</li>
<li>?  Optional</li>
</ul>

<p>
Explore relations to primary key in SQL.
</p>

<p>
Change userId to authorId.
</p>

<p>
Another thing we may do is use uuid() instead of autoincrement(). And so
change the type to string.
</p>

<p>
Explore what is missing on Post. Add its own Id.
</p>

<p>
The end of this part should be:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id      String  @id @default(uuid())
  name    String
  email   String
  isAdmin Boolean
  //  preferences Json
  Post    Post[]
}

model Post {
  id        String   @id @default(uuid())
  rating    Float
  createdAt DateTime
  updatedAt DateTime
  author    User     @relation(fields: [authorId], references: [id])
  authorId  String
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc11f3af" class="outline-3">
<h3 id="orgc11f3af"><span class="section-number-3">4.3.</span> Multiple One to Many</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Change User and Post models to:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id            String  @id @default(uuid())
  name          String
  email         String
  isAdmin       Boolean
  writtenPosts  Post[]
  favoritePosts Post[]
}

model Post {
  id            String   @id @default(uuid())
  rating        Float
  createdAt     DateTime
  updatedAt     DateTime
  author        User     @relation(fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User     @relation(fields: [favoritedById], references: [id])
  favoritedById String
} 


</pre>
</div>

<p>
Wich relation is pointint to which? This is ambiguous.
</p>

<p>
We may give a name to the Post relation and THEN refer to it on User.
</p>

<p>
Only then save it, show what happens if you save after changing post
but not inserting the relation to User.
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id            String  @id @default(uuid())
  name          String
  email         String
  isAdmin       Boolean
  writtenPosts  Post[] @relation("WrittenPosts")
  favoritePosts Post[] @relation("FavoritePosts")
}

model Post {
  id            String   @id @default(uuid())
  rating        Float
  createdAt     DateTime
  updatedAt     DateTime
  author        User     @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User?     @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String?
}
</pre>
</div>

<p>
For the last, explore changing favoritedBy and favoritedById to optional.
</p>

<p>
This is ok for disanbiguating multiple one to many relationships. But
what about&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgf459c04" class="outline-3">
<h3 id="orgf459c04"><span class="section-number-3">4.4.</span> Many to Many</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Create the Category model and add the many to many relation to both
Category and Post.
</p>

<div class="org-src-container">
<pre class="src src-prisma">model Category {
  id    String @id @default(uuid())
  posts Post[]
}

model Post {
  id            String     @id @default(uuid())
  rating        Float
  createdAt     DateTime
  updatedAt     DateTime
  author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String
  categories    Category[]
}
</pre>
</div>

<p>
We don't need to make any to do any fancy @relationship, it
automatically knows the references.
</p>

<p>
And it is automatically going to create a JOIN table that is going to
hook up all this relationships for us.
</p>

<p>
All the complicated JOIN stuff we need to do to many to many
relationships is taken care by Prisma, you don't need to worry about
that at all.
</p>
</div>
</div>

<div id="outline-container-org338ec8d" class="outline-3">
<h3 id="org338ec8d"><span class="section-number-3">4.5.</span> One to One</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Let's create a new model, UserPreference. Since we want one to one, we can declare
the relationship on ether model. We'll do it inside UserPreferences.
</p>

<div class="org-src-container">
<pre class="src src-prisma">model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user User
  userId String
}
</pre>
</div>

<p>
When we save it, a lot is done automatically, lets just change it a bit.
</p>

<p>
On User change the array to "one" relationship deleting [] and passing ?.
</p>

<p>
If not automatically, we need to define userId as @unique.
</p>

<p>
We know must have:
</p>
<div class="org-src-container">
<pre class="src src-prisma">model User {
  id             String          @id @default(uuid())
  name           String
  email          String
  isAdmin        Boolean
  writtenPosts   Post[]          @relation("WrittenPosts")
  favoritePosts  Post[]          @relation("FavoritePosts")
  UserPreference UserPreference?
}

model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user         User    @relation(fields: [userId], references: [id])
  userId       String  @unique
}  


</pre>
</div>

<p>
Let's talk about the attributes we've seen so far and add @updatedAt and also
@default(now()).
</p>

<p>
We now may have a Post model like this:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model Post {
  id            String     @id @default(uuid())
  rating        Float
  createdAt     DateTime   @default(now())
  updatedAt     DateTime   @updatedAt
  author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String
  categories    Category[]
}
</pre>
</div>
</div>
</div>
