README.org
** A little bit refactoring
Add title to Post. Rating to avgRating to float.

On category give a Name, string, unique.

User may have an age as Int.

We must have this now:
#+BEGIN_SRC prisma
  model User {
    id             String          @id @default(uuid())
    age            Int
    name           String
    email          String
    isAdmin        Boolean
    writtenPosts   Post[]          @relation("WrittenPosts")
    favoritePosts  Post[]          @relation("FavoritePosts")
    UserPreference UserPreference?
  }

  model UserPreference {
    id           String  @id @default(uuid())
    emailUpdates Boolean
    user         User    @relation(fields: [userId], references: [id])
    userId       String  @unique
  }

  model Post {
    id            String     @id @default(uuid())
    title         String
    avgRating     Float
    createdAt     DateTime   @default(now())
    updatedAt     DateTime   @updatedAt
    author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
    authorId      String
    favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
    favoritedById String
    categories    Category[]
  }

  model Category {
    id    String @id @default(uuid())
    name  String @unique
    posts Post[]
  }
 #+END_SRC

** Block Level Attributes
Different of the Attributes (which are declared in rows).

The Block Level Attributes will be declared on the end of the model
using @@.

#+BEGIN_SRC prisma
  model User {
    id             String          @id @default(uuid())
    age            Int
    name           String
    email          String
    isAdmin        Boolean
    writtenPosts   Post[]          @relation("WrittenPosts")
    favoritePosts  Post[]          @relation("FavoritePosts")
    UserPreference UserPreference?

    @@unique([age, name])
    @@index([email])
    // @@index([email, name])
  }

  model UserPreference {
    id           String  @id @default(uuid())
    emailUpdates Boolean
    user         User    @relation(fields: [userId], references: [id])
    userId       String  @unique
  }

  model Post {
    id            String     @id @default(uuid())
    title         String
    avgRating     Float
    createdAt     DateTime   @default(now())
    updatedAt     DateTime   @updatedAt
    author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
    authorId      String
    favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
    favoritedById String
    categories    Category[]

    // @@id([title, author])
  }

  model Category {
    id    String @id @default(uuid())
    name  String @unique
    posts Post[]
  }
#+END_SRC


@@unique will ad the unique constraint

@@index will help with thinks like sorting and performance

@@id (it is an option if you don't want
an conventional id but a composition of two attr)

** Enum

We can add an enum like:

#+BEGIN_SRC prisma
  enum Role {
    BASIC
    EDITOR
    ADMIN
  }
#+END_SRC

and set it to our user adding the line:

#+BEGIN_SRC prisma
  role           Role            @default(BASIC)
#+END_SRC

See why in our example we can't use enums (connector sqlite doesn't
support it).

Great advantage of being sure it will populate with the right list
item.
** Migrating
With the current schema.prisma (as in the end of "Block Level
Attributes"), we'll try to migrate with:

#+BEGIN_SRC bash
npx prisma migrate dev
#+END_SRC

An error!

Explore reading the error.

Try to delete everything with:
#+BEGIN_SRC typescript
   await prisma.user.deleteMany();
#+END_SRC

And then run the migration again.

Explore and ask the questions.

Explore the migration files and their dialects.
* Exploring the client
** Intro
We will talk about creating, reading, updating and deleting.

The prisma client must be a single instance. Otherwise the db might be
overwelmed with too many connections.

If auto-complete does not completes, we might need close/reopen file or
regenerate the client with:

#+BEGIN_SRC bash
npx prisma generate
#+END_SRC

** Creating
We will start with:

#+BEGIN_SRC typescript
async function main() {
  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
    },
  });

  console.log(user);
}
#+END_SRC

Saving again, we run it, we get the error expected.

Adding this to the beginning:

#+BEGIN_SRC typescript
  await prisma.user.deleteMany();
#+END_SRC

Using ctrl+space (auto-completition) we can also see that is possible
to specify data for favoritedPosts and userPreferences.

This is interisting because those are models that are not inside the
User, but they're referenced.

With prisma we can do all the nested create function in one go:

#+BEGIN_SRC typescript
async function main() {
  await prisma.user.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreference: {
        create: {
          emailUpdate: true,
        },
      },
    },
  });

  console.log(user);
}
#+END_SRC

We get the awnser to the creating but nothing about the userPreference.

To do so, we must use "include".

#+BEGIN_SRC typescript
async function main() {
  await prisma.user.deleteMany();
  await prisma.userPreference.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreferences: {
        create: {
          emailUpdate: true,
        },
      },
    },
    include: {
      userPreferences: true,
    },
  });

  console.log(user);
}
#+END_SRC


Instead of include we may want to use select.


#+BEGIN_SRC typescript
async function main() {
  await prisma.userPreference.deleteMany();
  await prisma.user.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreferences: {
        create: {
          emailUpdate: true,
        },
      },
    },
    select: {
      name: true,
    },
  });

  console.log(user);
}
#+END_SRC


Explore adding userPrefernces to the select and to use select on the
userPreferences to return only the id.

Important, only select OR include, not both.

PS:

If you want to log all of your queries, change the prisma creation to this:

#+BEGIN_SRC typescript
const prisma = new PrismaClient({ log: ["query"] });

#+END_SRC

Also explore `createMany`

#+BEGIN_SRC typescript
 prisma.user.createMany([{data...}, {}, {}])
#+END_SRC

