README.html

<div id="outline-container-orgf417e29" class="outline-3">
<h3 id="orgf417e29"><span class="section-number-3">4.6.</span> A little bit refactoring</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Add title to Post. Rating to avgRating to float.
</p>

<p>
On category give a Name, string, unique.
</p>

<p>
User may have an age as Int.
</p>

<p>
We must have this now:
</p>
<div class="org-src-container">
<pre class="src src-prisma">model User {
  id             String          @id @default(uuid())
  age            Int
  name           String
  email          String
  isAdmin        Boolean
  writtenPosts   Post[]          @relation("WrittenPosts")
  favoritePosts  Post[]          @relation("FavoritePosts")
  UserPreference UserPreference?
}

model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user         User    @relation(fields: [userId], references: [id])
  userId       String  @unique
}

model Post {
  id            String     @id @default(uuid())
  title         String
  avgRating     Float
  createdAt     DateTime   @default(now())
  updatedAt     DateTime   @updatedAt
  author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String
  categories    Category[]
}

model Category {
  id    String @id @default(uuid())
  name  String @unique
  posts Post[]
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e2b68b" class="outline-3">
<h3 id="org8e2b68b"><span class="section-number-3">4.7.</span> Block Level Attributes</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Different of the Attributes (which are declared in rows).
</p>

<p>
The Block Level Attributes will be declared on the end of the model
using @@.
</p>

<div class="org-src-container">
<pre class="src src-prisma">model User {
  id             String          @id @default(uuid())
  age            Int
  name           String
  email          String
  isAdmin        Boolean
  writtenPosts   Post[]          @relation("WrittenPosts")
  favoritePosts  Post[]          @relation("FavoritePosts")
  UserPreference UserPreference?

  @@unique([age, name])
  @@index([email])
  // @@index([email, name])
}

model UserPreference {
  id           String  @id @default(uuid())
  emailUpdates Boolean
  user         User    @relation(fields: [userId], references: [id])
  userId       String  @unique
}

model Post {
  id            String     @id @default(uuid())
  title         String
  avgRating     Float
  createdAt     DateTime   @default(now())
  updatedAt     DateTime   @updatedAt
  author        User       @relation("WrittenPosts", fields: [authorId], references: [id])
  authorId      String
  favoritedBy   User       @relation("FavoritePosts", fields: [favoritedById], references: [id])
  favoritedById String
  categories    Category[]

  // @@id([title, author])
}

model Category {
  id    String @id @default(uuid())
  name  String @unique
  posts Post[]
}
</pre>
</div>


<p>
@@unique will ad the unique constraint
</p>

<p>
@@index will help with thinks like sorting and performance
</p>

<p>
@@id (it is an option if you don't want
an conventional id but a composition of two attr)
</p>
</div>
</div>

<div id="outline-container-org7cd09b8" class="outline-3">
<h3 id="org7cd09b8"><span class="section-number-3">4.8.</span> Enum</h3>
<div class="outline-text-3" id="text-4-8">
<p>
We can add an enum like:
</p>

<div class="org-src-container">
<pre class="src src-prisma">enum Role {
  BASIC
  EDITOR
  ADMIN
}
</pre>
</div>

<p>
and set it to our user adding the line:
</p>

<div class="org-src-container">
<pre class="src src-prisma">role           Role            @default(BASIC)
</pre>
</div>

<p>
See why in our example we can't use enums (connector sqlite doesn't
support it).
</p>

<p>
Great advantage of being sure it will populate with the right list
item.
</p>
</div>
</div>
<div id="outline-container-orgd50674e" class="outline-3">
<h3 id="orgd50674e"><span class="section-number-3">4.9.</span> Migrating</h3>
<div class="outline-text-3" id="text-4-9">
<p>
With the current schema.prisma (as in the end of "Block Level
Attributes"), we'll try to migrate with:
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma migrate dev
</pre>
</div>

<p>
An error!
</p>

<p>
Explore reading the error.
</p>

<p>
Try to delete everything with:
</p>
<div class="org-src-container">
<pre class="src src-typescript">await prisma.user.deleteMany();
</pre>
</div>

<p>
And then run the migration again.
</p>

<p>
Explore and ask the questions.
</p>

<p>
Explore the migration files and their dialects.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf3c55ee" class="outline-2">
<h2 id="orgf3c55ee"><span class="section-number-2">5.</span> Exploring the client</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5d98ba2" class="outline-3">
<h3 id="org5d98ba2"><span class="section-number-3">5.1.</span> Intro</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We will talk about creating, reading, updating and deleting.
</p>

<p>
The prisma client must be a single instance. Otherwise the db might be
overwelmed with too many connections.
</p>

<p>
If auto-complete does not completes, we might need close/reopen file or
regenerate the client with:
</p>

<div class="org-src-container">
<pre class="src src-bash">npx prisma generate
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc376814" class="outline-3">
<h3 id="orgc376814"><span class="section-number-3">5.2.</span> Creating</h3>
<div class="outline-text-3" id="text-5-2">
<p>
We will start with:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
Saving again, we run it, we get the error expected.
</p>

<p>
Adding this to the beginning:
</p>

<div class="org-src-container">
<pre class="src src-typescript">await prisma.user.deleteMany();
</pre>
</div>

<p>
Using ctrl+space (auto-completition) we can also see that is possible
to specify data for favoritedPosts and userPreferences.
</p>

<p>
This is interisting because those are models that are not inside the
User, but they're referenced.
</p>

<p>
With prisma we can do all the nested create function in one go:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  await prisma.user.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreference: {
        create: {
          emailUpdate: true,
        },
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
We get the awnser to the creating but nothing about the userPreference.
</p>

<p>
To do so, we must use "include".
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  await prisma.user.deleteMany();
  await prisma.userPreference.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreferences: {
        create: {
          emailUpdate: true,
        },
      },
    },
    include: {
      userPreferences: true,
    },
  });

  console.log(user);
}
</pre>
</div>


<p>
Instead of include we may want to use select.
</p>


<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  await prisma.userPreference.deleteMany();
  await prisma.user.deleteMany();

  const user = await prisma.user.create({
    data: {
      name: "Rahul",
      email: "rahul@test.com",
      age: 36,
      userPreferences: {
        create: {
          emailUpdate: true,
        },
      },
    },
    select: {
      name: true,
    },
  });

  console.log(user);
}
</pre>
</div>


<p>
Explore adding userPrefernces to the select and to use select on the
userPreferences to return only the id.
</p>

<p>
Important, only select OR include, not both.
</p>

<p>
PS:
</p>

<p>
If you want to log all of your queries, change the prisma creation to this:
</p>

<div class="org-src-container">
<pre class="src src-typescript">const prisma = new PrismaClient({ log: ["query"] });

</pre>
</div>

<p>
Also explore `createMany`
</p>

<div class="org-src-container">
<pre class="src src-typescript">prisma.user.createMany([{data...}, {}, {}])
</pre>
</div>
</div>
</div>
