README.html

<div id="outline-container-org9b672a1" class="outline-3">
<h3 id="org9b672a1"><span class="section-number-3">5.3.</span> Finding (reading data)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Let's first create several entries&#x2026;
</p>

<p>
After that, let's take a look at the db.
</p>

<p>
And also take a look at
</p>
<div class="org-src-container">
<pre class="src src-bash">npx prisma studio
</pre>
</div>


<p>
Let's take a look on findUnique.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {

  const user = await prisma.user.findUnique({
    where: {
      email: "rahul@test.com",
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We can also add include / select.
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  // await prisma.userPreference.deleteMany();
  // await prisma.user.deleteMany();

  const user = await prisma.user.findUnique({
    where: {
      email: "rahul@test.com",
    },
    select: {
      name: true,
      email: true,
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We can also explore now the "age<sub>name</sub>"  property created by our @@unique.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findUnique({
    where: {
      age_name: {
        age: 36,
        name: "Rahul",
      },
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
If we try to find this were by "name" there's no uniqueness so it is not
possible.
</p>

<p>
In this case, we need to search the other find methods, such as.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findFirst({
    where: {
      name: "Navarro",
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We can also use findMany, like:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      age: 36,
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
For repeated data, we can use "dintinct".
</p>

<p>
Let's create some other two users:
</p>

<div class="org-src-container">
<pre class="src src-typescript">await prisma.user.create({
   data: {
     name: "Boris",
     age: 2,
     email: "boris@test1.com",
   },
 });

 await prisma.user.create({
  data: {
    name: "Boris",
    age: 3,
    email: "boris@test2.com",
  },
});

 await prisma.user.create({
  data: {
    name: "Boris",
    age: 4,
    email: "boris@test3.com",
  },
});  

</pre>
</div>

<p>
Now this should return two users:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
  });

  console.log(user);
}  

</pre>
</div>

<p>
We can apply a distinctiness by name, such as.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
    distinct: ["name"],
  });

  console.log(user);
}
</pre>
</div>

<p>
Explore adding "age" to the distinct.
</p>

<p>
More important than distinct is pagination.
</p>

<p>
We can do it with take.
</p>


<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
    take: 2,
  });

  console.log(user);
}
</pre>
</div>


<p>
We can also combine with skip.
</p>


<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
    take: 2,
    skip: 1,
  });

  console.log(user);
}
</pre>
</div>

<p>
We can also order our results:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
    orderBy: {
      age: "asc",
    },
  take: 2,
  skip: 1,
  });

  console.log(user);
}  
</pre>
</div>

<p>
Now, fun with "WHERE" :)
</p>


<p>
Those are equivalent:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Boris",
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: { equals: "Boris" },
    },
  });

  console.log(user.length);
}
</pre>
</div>

<p>
Explore changing equals to "not" and
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: { in: ["Boris", "Rahul"] },
    },
  });

  console.log(user.length);
}
</pre>
</div>

<p>
Explore changing in for "notIn".
</p>


<p>
We can also provide queries on numbers:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      name: "Navarro",
      age: {
        lt: 40,
      },
    },
  });

  console.log(user.length);
}
</pre>
</div>

<p>
Explore gt, lte, gte, &#x2026;
</p>

<p>
There's also "contains".
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      email: {
        contains: "@test.com",
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
Explore instead of contains: "startsWith", "endsWith".
</p>

<p>
We can also add boolean logic with:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      AND: [{ email: { startsWith: "boris" } }, { name: "Boris" }],
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
This is equivalent to doing on the same level, the only reason one would
do it this way is comparing the same field multiple times, like in:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      AND: [
        { email: { startsWith: "boris" } },
        { email: { endsWith: "@test1.com" } },
      ],
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
We can also use OR:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      OR: [{ email: { startsWith: "boris" } }, { age: { lte: 3 } }],
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
And for last, there's NOT.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      NOT: [{ email: { startsWith: "boris" } }],
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
What about quering relationships?
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      userPreferences: {
        emailUpdate: true,
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
What about quering user posts?
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      writtenPosts: {
        every: {
          title: "test",
        },
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
funny thing, there's no posts.
</p>

<p>
Let's add some posts:
</p>

<div class="org-src-container">
<pre class="src src-typescript">await prisma.post.create({
  data: {
    averageRating: 5,
    title: "This is my post",
    authorId: "61127f06-889e-42d7-9bea-e2d525fc0f46",
  },
});
</pre>
</div>

<p>
Also change where to some and none.
</p>

<p>
Nesting can be done on infinity levels, like:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.findMany({
    where: {
      writtenPosts: {
        every: {
          title: { startsWith: "Test" },
        },
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
Another type of query on relationship filter&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const post = await prisma.post.findMany({
    where: {
      author: {
        is: {
          age: 36,
        },
      },
    },
  });

  console.log(post);
}
</pre>
</div>

<p>
See that now we have is and is not.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const post = await prisma.post.findMany({
    where: {
      author: {
        is: {
          age: 36,
        },
        isNot: {
          name: "Rahul",
        },
      },
    },
  });

  console.log(post);
}
</pre>
</div>
</div>
</div>
