README.html
<div id="outline-container-org3ebc3c7" class="outline-3">
<h3 id="org3ebc3c7"><span class="section-number-3">5.4.</span> Updating</h3>
<div class="outline-text-3" id="text-5-4">
<p>
We have update and updateMany.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.update({
    where: {
      email: "rahul@test.com",
    },
    data: {
      email: "rahul@test1.com",
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We can also use include and select with it like any other.
</p>

<p>
UpdateMany will update all matching.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.updateMany({
    where: {
      name: "Boris",
    },
    data: {
      name: "Borinho",
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
Important, updateMany (and createMany), there's NO SELECT NOR INCLUDE!
</p>

<p>
Let's try update our age:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.update({
    where: {
      name: "Rahul",
    },
    data: {
      age: {
        increment: 1,
      },
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We get an error as name is not a unique attribute.
</p>

<p>
Let's change to e-mail.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.update({
    where: {
      email: "rahul@test1.com",
    },
    data: {
      age: {
        increment: 1,
      },
    },
  });
  console.log(user);
}
</pre>
</div>

<p>
We can also use decrement, multiply and divide.
</p>
</div>
</div>

<div id="outline-container-org50df675" class="outline-3">
<h3 id="org50df675"><span class="section-number-3">5.5.</span> Add and Connect Existent Relationships</h3>
<div class="outline-text-3" id="text-5-5">
<p>
On the update we can create new fields, or we can connect/disconnect, such as:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.update({
    where: {
      email: "navarro@test.com",
    },
    data: {
      writtenPosts: {
        connect: {
          id: "b2e5b41e-5acc-44c3-9890-4676069041b0",
        },
      },
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
If it is a one to one relationship, disconnect only needs to be true.
</p>

<p>
This is not only for updates, but also for create.
</p>
</div>
</div>

<div id="outline-container-org942bc34" class="outline-3">
<h3 id="org942bc34"><span class="section-number-3">5.6.</span> Deleting</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Works very similar to finding.
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.delete({
    where: {
      name: "Borinho",      
    }
  });

  console.log(user);
}  
</pre>
</div>

<p>
This will not work since delete needs a unique field.
</p>

<p>
Changing to email:
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.delete({
    where: {
      email: "esquilos@test.com",
    },
  });

  console.log(user);
}
</pre>
</div>

<p>
If we have an error of costrains, it might be usefull adding the
onDelete property to the relationship, such as:
</p>

<div class="org-src-container">
<pre class="src src-prisma">model UserPreference {
  id          String  @id @default(uuid())
  emailUpdate Boolean
  user        User    @relation(fields: [userId], references: [id], onDelete: Cascade)
  userId      String  @unique
}
</pre>
</div>


<p>
If we wan't to delete many entries.
</p>

<div class="org-src-container">
<pre class="src src-typescript">async function main() {
  const user = await prisma.user.deleteMany({
    where: {
      age: { equals: 3 },
    },
  });

  console.log(user);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org53744c6" class="outline-2">
<h2 id="org53744c6"><span class="section-number-2">6.</span> Future topics</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd0d6e50" class="outline-3">
<h3 id="orgd0d6e50"><span class="section-number-3">6.1.</span> Views</h3>
</div>
<div id="outline-container-orgd3a610d" class="outline-3">
<h3 id="orgd3a610d"><span class="section-number-3">6.2.</span> Importing database to prisma</h3>
</div>
<div id="outline-container-org48c1185" class="outline-3">
<h3 id="org48c1185"><span class="section-number-3">6.3.</span> GraphQL client</h3>
</div>
<div id="outline-container-org85dc1ca" class="outline-3">
<h3 id="org85dc1ca"><span class="section-number-3">6.4.</span> REPL</h3>
</div>
<div id="outline-container-org7164949" class="outline-3">
<h3 id="org7164949"><span class="section-number-3">6.5.</span> DB Push</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rahul M. Juliato</p>
<p class="date">Created: 2023-01-24 Ter 17:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>